[
  {
    "cardHeight": 350,
    "name": "Shoppa",
    "timeline": "Jan - Nov 2023",
    "shortDescription": "An online ecommerce marketplace.",
    "id": "shoppa",
    "thumbnail": "shoppa.png",
    "content": [
      {
        "title": "About the project",
        "content": "Shoppa is an innovative online e-commerce platform tailored to assist small businesses in swiftly establishing their online presence. With its unique marketplace feature, each business receives its own dedicated page for public advertising. The platform offers a user-friendly dashboard allowing businesses to efficiently manage various aspects of their store, including product inventory, customer interactions, order fulfillment, invoicing, campaign management, and more. Plus, with its seamless setup process, businesses can have their store up and running in no time."
      },
      {
        "title": "My part",
        "content": "I led the development effort at Shoppa, where I played a key role in bringing our online e-commerce platform to life. One of my major contributions was creating a versatile UI Library from scratch. This library became the backbone of our project, allowing us to build features quickly and efficiently. Additionally, I structured the online payment system to ensure seamless and secure transactions for our users. Finally, I innovated a fantastic tool for generating invoices with ease, making our invoicing process a breeze."
      },
      {
        "title": "Challenges",
        "content": "One of the significant challenges we encountered at Shoppa was refining the payment system. It required extensive effort and took considerable time, lasting days if not weeks, to devise an optimal strategy. However, I led the effort to simplify and improve the process, ultimately developing a more efficient solution.<br/><br/>Another challenge we faced was the need to efficiently develop multiple projects simultaneously while ensuring scalability. To address this, I took the initiative to create an exceptional UI library [(https://yasa-ui.netlify.app)](https://yasa-ui.netlify.app). This library not only facilitated rapid development but also ensured that projects were well-organized and scalable."
      },
      {
        "title": "Gallery",
        "gallery": [
          "1.png",
          "2.png",
          "3.png",
          "4.png",
          "5.png",
          "6.png",
          "7.png",
          "8.png"
        ]
      }
    ]
  },
  {
    "cardHeight": 350,
    "name": "Proprep",
    "id": "proprep",
    "shortDescription": "Study STEM online",
    "thumbnail": "proprep.png",
    "timeline": "june - august 2022",
    "content": [
      {
        "title": "Visit Proprep",
        "content": "<a href='https://proprep.com' target='_blank'>https://proprep.com</a>"
      },
      {
        "title": "About the project",
        "content": "Proprep is an innovative online learning platform tailored to the unique needs of university students studying STEM subjects. With access to over 60,000 videos, Proprep offers personalized learning experiences aligned with each student's university syllabus and textbooks. Whether it's calculus, physics, general chemistry, or more, Proprep provides on-demand access to educational content from esteemed lecturers, enabling students to enhance their understanding anytime, anywhere, and from any device."
      },
      {
        "title": "My part",
        "content": "As the sole front-end developer, I played a pivotal role in the development of ProPrep, tackling numerous challenges under significant time constraints, completing the project in less than two months. My responsibilities included building a robust design system, implementing a seamless payment system, integrating localizations for global accessibility, developing a sophisticated video player, and enhancing the platform with complex search capabilities, among other tasks. Despite the pressure, I successfully delivered a high-quality platform that met the diverse needs of our users."
      },
      {
        "title": "Gallery",
        "gallery": ["1.png", "2.png", "3.png", "4.png", "5.png", "6.png"]
      }
    ]
  },
  {
    "cardHeight": 350,
    "name": "3 Walls",
    "id": "3-walls",
    "shortDescription": "Immersive learning experience",
    "thumbnail": "3walls.png",
    "timeline": "9/2022 - 2/2024",
    "content": [
      {
        "title": "Visit 3walls",
        "content": "<a href='https://3walls.org' target='_blank'>https://3walls.org</a>"
      },
      {
        "title": "Gallery",
        "gallery": ["1.mp4", "3.mp4"]
      }
    ]
  }
]
