[
  {
    "cardHeight": 350,
    "name": "Shoppa",
    "timeline": "Jan - Nov 2023",
    "shortDescription": "An online ecommerce marketplace.",
    "id": "shoppa",
    "thumbnail": "shoppa.png",
    "content": [
      {
        "title": "About Shoppa",
        "content": "Shoppa is an innovative online e-commerce platform tailored to assist small businesses in swiftly establishing their online presence. With its unique marketplace feature, each business receives its own dedicated page for public advertising. The platform offers a user-friendly dashboard allowing businesses to efficiently manage various aspects of their store, including product inventory, customer interactions, order fulfillment, invoicing, campaign management, and more. Plus, with its seamless setup process, businesses can have their store up and running in no time."
      },
      {
        "title": "My part",
        "content": "I led the development effort at Shoppa, where I played a key role in bringing our online e-commerce platform to life. One of my major contributions was creating a versatile UI Library from scratch. This library became the backbone of our project, allowing us to build features quickly and efficiently. Additionally, I structured the online payment system to ensure seamless and secure transactions for our users. Finally, I innovated a fantastic tool for generating invoices with ease, making our invoicing process a breeze."
      },
      {
        "title": "Challenges",
        "content": "One of the significant challenges we encountered at Shoppa was refining the payment system. It required extensive effort and took considerable time, lasting days if not weeks, to devise an optimal strategy. However, I led the effort to simplify and improve the process, ultimately developing a more efficient solution.<br/><br/>Another challenge we faced was the need to efficiently develop multiple projects simultaneously while ensuring scalability. To address this, I took the initiative to create an exceptional UI library [(https://yasa-ui.netlify.app)](https://yasa-ui.netlify.app). This library not only facilitated rapid development but also ensured that projects were well-organized and scalable."
      },
      {
        "title": "Gallery",
        "gallery": [
          "1.png",
          "2.png",
          "3.png",
          "4.png",
          "5.png",
          "6.png",
          "7.png",
          "8.png"
        ]
      }
    ]
  },

  {
    "cardHeight": 350,
    "name": "Proprep",
    "id": "proprep",
    "shortDescription": "Study STEM online",
    "thumbnail": "proprep.png",
    "timeline": "june - august 2022",
    "content": [
      {
        "title": "Visit Proprep",
        "content": "<a href='https://proprep.com' target='_blank'>https://proprep.com</a>"
      },
      {
        "title": "About Proprep",
        "content": "Proprep is an innovative online learning platform tailored to the unique needs of university students studying STEM subjects. With access to over 60,000 videos, Proprep offers personalized learning experiences aligned with each student's university syllabus and textbooks. Whether it's calculus, physics, general chemistry, or more, Proprep provides on-demand access to educational content from esteemed lecturers, enabling students to enhance their understanding anytime, anywhere, and from any device."
      },
      {
        "title": "My part",
        "content": "As the sole front-end developer, I played a pivotal role in the development of ProPrep, tackling numerous challenges under significant time constraints, completing the project in less than two months. My responsibilities included building a robust design system, implementing a seamless payment system, integrating localizations for global accessibility, developing a sophisticated video player, and enhancing the platform with complex search capabilities, among other tasks. Despite the pressure, I successfully delivered a high-quality platform that met the diverse needs of our users."
      },
      {
        "title": "Gallery",
        "gallery": ["1.png", "2.png", "3.png", "4.png", "5.png", "6.png"]
      }
    ]
  },
  {
    "cardHeight": 350,
    "name": "3 Walls",
    "id": "3-walls",
    "shortDescription": "Immersive learning experience",
    "thumbnail": "3-walls.png",
    "timeline": "9/2022 - 2/2024",
    "content": [
      {
        "title": "Visit 3walls",
        "content": "<a href='https://3walls.org' target='_blank'>https://3walls.org</a>"
      },
      {
        "title": "About 3 Walls",
        "content": "\"3-Walls\" introduces a groundbreaking software platform tailored for immersive learning environments. With synchronized screens spanning three walls, educators can captivate audiences with engaging and synchronized lessons. This innovative setup offers a visually stunning and interactive experience, perfect for classrooms, training sessions, or any educational setting aiming to enhance engagement and retention."
      },
      {
        "title": "My part",
        "content": "In the \"3-Walls\" project, I took charge of developing the software to showcase immersive lessons across synchronized screens. Alongside, I crafted a lecturer dashboard, enabling easy lesson creation and management. Additionally, I built an intuitive administrative interface for overseeing schools, users, lessons, categories, and other essential elements of the platform."
      },
      {
        "title": "Challenges",
        "content": "Creating the software for \"3-Walls\" posed unique challenges due to its niche nature. To overcome these hurdles, I embraced innovation and explored various technologies and approaches. Given the time constraints, optimizing the code for efficiency was paramount. I conducted extensive testing to find the optimal strategy, ensuring the solution not only worked swiftly but also remained scalable for accommodating diverse components."
      },
      {
        "title": "Gallery",
        "gallery": ["3-walls.png", "1.mp4", "2.jpg", "3.mp4", "4.png"]
      }
    ]
  },
  {
    "cardHeight": 350,
    "name": "Aba hatuv",
    "id": "aba-hatuv",
    "shortDescription": "A weight loss program.",
    "thumbnail": "aba-hatuv.png",
    "timeline": "2/2023 - 1/2024",
    "content": [
      {
        "title": "Visit Aba Hatuv",
        "content": "<a href='https://www.leptin4life.com' target='_blank'>https://www.leptin4life.com</a>"
      },
      {
        "title": "About Aba Hatuv",
        "content": "Aba Hatuv (Fit Daddy) is a transformative weight loss program designed to support individuals on their journey to better health. Participants receive daily tailored content focusing on diet and healthy eating, supplemented by personalized coaching and progress tracking features. The program has yielded remarkable results, positively impacting the lives of its users, leading to significant improvements in health and well-being."
      },
      {
        "title": "Work flow",
        "content": "Our team for Aba Hatuv comprised frontend, backend, and mobile developers. The frontend segment demanded extensive effort, particularly under tight deadlines. Assigned the most demanding tasks, I managed to deliver ahead of schedule, despite the intense time pressure. Additionally, I provided support to the mobile development team, assisting them in overcoming their challenges. This collaborative workflow ensured successful delivery and highlighted our team's ability to adapt and excel in demanding situations."
      },
      {
        "title": "Challenges",
        "content": "The most significant challenge I tackled was developing the content creation system for Aba Hatuv. This system allowed admins to manage content using versatile content cards, incorporating various components and organizing them into customizable programs. Overcoming numerous technical hurdles such as *drag-and-drop* functionality, *complex state management*, and ensuring *live updates* presented a substantial challenge.<br/><br/>On the mobile app, I focused on developing user progress screens featuring visually appealing charts and content display screens built from flexible components, prioritizing fast user experience and content loading.<br/><br/>Additionally, I implemented the user-coach chat functionality, utilizing a plugin for seamless communication. My role involved developing the coach-side interface and internal chats for Aba Hatuv staff, leveraging my *expertise in UI/U* design to ensure intuitive and user-friendly interfaces."
      },
      {
        "title": "Gallery",
        "gallery": ["1.jpg", "2.jpg", "3.jpg", "4.jpg"]
      }
    ]
  },
  {
    "cardHeight": 350,
    "name": "Yasa UI",
    "id": "yasa-ui",
    "shortDescription": "An awesome UI library",
    "thumbnail": "yasa-ui.png",
    "timeline": "4/2023 - 8/2024",
    "content": [
      {
        "title": "Visit Yasa UI",
        "content": "<a href='https://yasa-ui.netlify.app' target='_blank'>https://yasa-ui.netlify.app</a>"
      },
      {
        "title": "About Yasa UI",
        "content": "Yasa UI is an awesome UI library built with React & Sass for quick development of management system, including complex components for forms, tables, paginations. Yasa UI supports RTL & color themes out of the box, and it is truly a time saver"
      },
      {
        "title": "Agenda",
        "content": "In my career I found developing certian components to  be repetative, after I perfected the development of those componenst (tables, forms, pagination, etc.) it was time to put all my knowledge into one awesome & resusable project. It was originaly built for <a href='/projects/shoppa'>Shoppa</a>, but since then I used it on countless projects"
      },
      {
        "title": "Gallery",
        "gallery": ["1.png", "2.png", "3.png", "4.png", "5.png", "6.png"]
      }
    ]
  },
  {
    "cardHeight": 350,
    "name": "Rabinovich",
    "id": "rabinovich",
    "shortDescription": "Foundation",
    "thumbnail": "rabinovich.png",
    "timeline": "5/2022 - 7/2022",
    "content": [
      {
        "title": "Visit Rabinovich",
        "content": "<a href='https://www.rabinovichfoundation.org.il' target='_blank'>https://www.rabinovichfoundation.org.il</a><br/><a href='https://www.youtube.com/watch?v=Z8sPTNM9SUY' target='_blank'>Movie example - לשחרר את שולי</a>"
      },
      {
        "title": "About Rabinovich",
        "content": "Rabinovich is a foundation that assists artists in funding film projects, providing financial support and resources to bring creative visions to life on the big screen."
      },
      {
        "title": "My role",
        "content": "As the sole frontend developer for Rabinovich, my focus was on crafting dashboard screens tailored for admins. These screens facilitated essential tasks such as managing movie applications, lectures, funding, assigning reviews, and overseeing user management. Leveraging my expertise in frontend development, I ensured these interfaces were intuitive, user-friendly, and efficiently supported the foundation's operations."
      },
      {
        "title": "Challenges",
        "content": "One of the main challenges I faced was handling large, complex, and stateful forms used by both administrators for creation and individuals for submission. I had to ensure effective display, validation, and usability to accommodate these dual roles seamlessly."
      },
      {
        "title": "Gallery",
        "gallery": ["rabinovich.png"]
      }
    ]
  }
]
